Tekla.Structures.Analysis.AnalysisDesignSettings
The AnalysisDesignSettings class contains information about analysis design settings.

Tekla.Structures.Analysis.AnalysisDesignSettings._SteelDesignCode
Steel design code.

Tekla.Structures.Analysis.AnalysisDesignSettings._SteelDesignMethod
Steel design method.

Tekla.Structures.Analysis.AnalysisDesignSettings._ConcreteDesignCode
Concrete design code.

Tekla.Structures.Analysis.AnalysisDesignSettings._ConcreteDesignMethod
Concrete design method.

Tekla.Structures.Analysis.AnalysisDesignSettings._TimberDesignCode
Timber design code.

Tekla.Structures.Analysis.AnalysisDesignSettings._TimberDesignMethod
Timber design method.

Tekla.Structures.Analysis.AnalysisDesignSettings.#ctor
Creates a new analysis design settings instance.

Tekla.Structures.Analysis.AnalysisDesignSettings.SteelDesignCode
The steel design code.

Tekla.Structures.Analysis.AnalysisDesignSettings.SteelDesignMethod
The steel design method.

Tekla.Structures.Analysis.AnalysisDesignSettings.ConcreteDesignCode
The concrete design code.

Tekla.Structures.Analysis.AnalysisDesignSettings.ConcreteDesignMethod
The concrete design method.

Tekla.Structures.Analysis.AnalysisDesignSettings.TimberDesignCode
The timber design code.

Tekla.Structures.Analysis.AnalysisDesignSettings.TimberDesignMethod
The timber design method.